#+title: Notas de Aula - 09 Modularização
#+author: Luigi D. C. Soares
#+startup: entitiespretty
#+options: toc:nil  num:nil
* Do Código Fonte ao Executável

A transformação do código que escrevemos em uma linguagem de programação para um programa executável envolve várias fases. No caso de C++, estas etapas são:

(1) *Pré-processamento*: nesta fase, todas aquelas macros prefixadas com o caractere *#* são processadas. Por exemplo, quando o pré-processador encontra o comando ~#include <iostream>~, ele o substitui por todo o conteúdo do cabeçalho ~iostream~.

Considere o seguinte programa:

=include/header.hpp=

#+begin_src C++ :exports code :tangle include/header.hpp :main no
#pragma once
int sum(int x, int y);
#+end_src

=src/header.cpp=

#+begin_src C++ :exports code :tangle src/header.cpp :main no
#include "header.hpp"
int sum(int x, int y) {
  return x + y;
}
#+end_src

=src/main.cpp=

#+begin_src C++ :exports code :tangle src/main.cpp
#include "header.hpp"
int main() {
  return sum(1, 2);
}
#+end_src

Para observamos a saída da fase de pré-processamento, executamos o comando

#+begin_src sh :exports both :results scalar
g++ -std=c++17 -I include/ -E src/main.cpp
#+end_src

#+RESULTS:
#+begin_example
# 0 "src/main.cpp"
# 0 "<built-in>"
# 0 "<command-line>"
# 1 "/nix/store/hkj250rjsvxcbr31fr1v81cv88cdfp4l-glibc-2.37-8-dev/include/stdc-predef.h" 1 3 4
# 0 "<command-line>" 2
# 1 "src/main.cpp"
# 1 "include/header.hpp" 1
       
int sum(int x, int y);
# 2 "src/main.cpp" 2
int main() {
  return sum(1, 2);
}
#+end_example

(2) *Compilação*: o processo de compilação por si só envolve várias etapas, como análises sintáticas e semânticas. O resultado final é o código assembly correspondente ao código de entrada. Assembly é uma representação humanamente legível do código de máquina (o formato final). Podemos produzir o assembly com o seguinte comando:

#+begin_src sh :exports both :results scalar
g++ -std=c++17 -I include/ -S src/main.cpp -o build/main.s
cat build/main.s # Para ler o conteúdo do arquivo
#+end_src

#+RESULTS:
#+begin_example
	.file	"main.cpp"
	.text
	.globl	main
	.type	main, @function
main:
.LFB0:
	.cfi_startproc
	pushq	%rbp
	.cfi_def_cfa_offset 16
	.cfi_offset 6, -16
	movq	%rsp, %rbp
	.cfi_def_cfa_register 6
	movl	$2, %esi
	movl	$1, %edi
	call	_Z3sumii
	nop
	popq	%rbp
	.cfi_def_cfa 7, 8
	ret
	.cfi_endproc
.LFE0:
	.size	main, .-main
	.ident	"GCC: (GNU) 12.2.0"
	.section	.note.GNU-stack,"",@progbits
#+end_example

(3) *Assembly*: o código no formato assembly é entregue para um programa conhecido como /assembler/, que traduz esta representação humanamente legível para o código de máquina. Em C++, chamamos o resultado deste processo de arquivo /objeto/. Este ainda não é o arquivo final, executável. Podemos gerar o arquivo objeto com o seguinte comando:

#+begin_src sh :exports code :results none
g++ -std=c++17 -I include/ -c src/main.cpp -o build/main.o
#+end_src

(4) *Ligação*: você deve ter reparado que em nenhuma das três etapas acima o arquivo de código =src/header.cpp= foi referenciado. Isto, porque as três etapas anteriores são sempre realizadas individualmente para cada /unidade de tradução/. Uma unidade de tradução corresponde ao conteúdo de único arquivo de código (=.cpp=) após este ter passado pela etapa de pré-processamento.

Quando executamos o comando =g++ -std=c++17 -I include/ src/main.cpp src/header.cpp -o bin/main.cpp=, implicitamente dois comandos são executados separadamente:

#+begin_src sh :exports code :results none
g++ -std=c++17 -I include -c src/main.cpp -o build/main.o
g++ -std=c++17 -I include -c src/header.cpp -o build/header.o
#+end_src

Este dois arquivos objetos gerados ainda precisam ser conectados, o que é feito com o comando

#+begin_src sh :exports code :results none
g++ build/main.o build/header.o -o bin/main
#+end_src

** Conceitos Básicos do Makefile

O =Makefile= é composto de /alvos/, cada alvo contendo comandos a serem executados:

#+begin_src makefile :tangle Makefile
alvo:
	echo "Meu primeiro alvo"
	echo "Meu segundo comando"
#+end_src

Utilizamos a ferramenta =make= da seguinte forma:

#+begin_src sh :exports both :results scalar
make alvo
#+end_src

#+RESULTS:
: echo "Meu primeiro alvo"
: Meu primeiro alvo
: echo "Meu segundo comando"
: Meu segundo comando

Por padrão, o make produz como saída não somente as saídas dos comandos executados como também os próprios comandos. Podemos esconder os comandos com um @:

#+begin_src makefile :tangle Makefile
alvo_sem_echo:
	@echo "Meu segundo alvo"
#+end_src

#+begin_src sh :exports both :results scalar
make alvo_sem_echo
#+end_src

#+RESULTS:
: Meu segundo alvo

Além de comandos, um alvo pode ter /dependências/. Por exemplo, ao executar o alvo ~alvo_dependente~ a seguir, o alvo ~say_hello~ irá executar primeiro:

#+begin_src makefile :tangle Makefile
say_hello:
	@echo "Hello"

alvo_dependente: say_hello
	@echo "Dependente - Sorriso Maroto"
#+end_src

#+begin_src sh :exports both :results scalar
make alvo_dependente
#+end_src

#+RESULTS:
: Hello
: Dependente - Sorriso Maroto

Por fim, podemos definir /variáveis/:

#+begin_src makefile :tangle Makefile
minha_variavel := "variável"
echo_variavel:
	@echo "O valor da minha variável é: $(minha_variavel)"
#+end_src

#+begin_src sh :exports both :results scalar
make echo_variavel
#+end_src

#+RESULTS:
: O valor da minha variável é: variável

